// #include "ScriptParser.hpp"
// using namespace std;


// ----------------------------------------------------------------
//	Name：			ScriptParser.hpp
//	Description:	读取文件，建立多叉树
//					此时脚很还不支持注释功能...
//					也不支持OFFSET项...
//	Creat Time:		4/9/2009 
//	Author:			RenYaFei
// ----------------------------------------------------------------


// ----------------------------------------------------------------
//	Script format:	...
//	Description:	关键字ROOT根节点
//					JOINT一般的节点
//					END终端节点
//					OFFSET为偏移量，可用可无，
//					没有的话，可以优化，计算出最佳的位置，偏移量
//					包含关系通过花括号{} 或者<>解析
//					注释使用[]
// ----------------------------------------------------------------

// ----------------------------------------------------------------
//	History:		增加了使用迭代器创建tree的函数
//					只有使用了迭代器以后才能真正做到隐藏
//						node的具体细节，数据结构和算法分离
//					recursBuildByIterator()
//					generateJointByIterator()
//	Time:			[4/12/2009 RenYaFei]
// ----------------------------------------------------------------


// ----------------------------------------------------------------
//	脚本：
/*
ROOT one
{
	OFFSET 0.0 0.0 0.0	//可有可无
		JOINT two
	{
		END apple
		{
		}
		END banana
		{
		}
		END peach
		{
		}
	}
	JOINT three
	{
		END china
		{
		}
		END england
		{
		}
	}
}
*/
// ----------------------------------------------------------------